#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/chuanfrost98/gh-actions-demo/runs/run-BhCYLYkkM8TBbNW7

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
data.archive_file.hello-world-terraform-aws: Reading...
data.archive_file.hello-world-terraform-aws: Read complete after 0s [id=38615aadcaf592b9ebd8c472f4e654c8fd483cd1]
aws_api_gateway_rest_api.hello-world-terraform-aws: Refreshing state... [id=c0ojzhtqbh]
aws_iam_role.hello-world-terraform-aws: Refreshing state... [id=hello-world-terraform-aws]
aws_lambda_function.hello_world: Refreshing state... [id=HelloWorld]
aws_lambda_function.bye_world: Refreshing state... [id=ByeWorld]
aws_api_gateway_resource.hello_world_api: Refreshing state... [id=ncpgar]
aws_api_gateway_resource.bye_world_api: Refreshing state... [id=eyvffh]
aws_lambda_permission.hello_world_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.bye_world_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_method.bye_world_get: Refreshing state... [id=agm-c0ojzhtqbh-eyvffh-GET]
aws_api_gateway_method.hello_world_get: Refreshing state... [id=agm-c0ojzhtqbh-ncpgar-GET]
aws_api_gateway_integration.bye_world_get: Refreshing state... [id=agi-c0ojzhtqbh-eyvffh-GET]
aws_api_gateway_integration.hello_world_get: Refreshing state... [id=agi-c0ojzhtqbh-ncpgar-GET]
aws_api_gateway_deployment.hello-world-terraform-aws: Refreshing state... [id=11sphf]
aws_api_gateway_stage.prod_stage: Refreshing state... [id=ags-c0ojzhtqbh-prod]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_api_gateway_deployment.hello-world-terraform-aws has been deleted
  - resource "aws_api_gateway_deployment" "hello-world-terraform-aws" {
      - id            = "11sphf" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_method.bye_world_get has been deleted
  - resource "aws_api_gateway_method" "bye_world_get" {
      - http_method      = "GET" -> null
        id               = "agm-c0ojzhtqbh-eyvffh-GET"
      - resource_id      = "eyvffh" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_method.hello_world_get has been deleted
  - resource "aws_api_gateway_method" "hello_world_get" {
      - http_method      = "GET" -> null
        id               = "agm-c0ojzhtqbh-ncpgar-GET"
      - resource_id      = "ncpgar" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.bye_world_api has been deleted
  - resource "aws_api_gateway_resource" "bye_world_api" {
      - id          = "eyvffh" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.hello_world_api has been deleted
  - resource "aws_api_gateway_resource" "hello_world_api" {
      - id          = "ncpgar" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_rest_api.hello-world-terraform-aws has been deleted
  - resource "aws_api_gateway_rest_api" "hello-world-terraform-aws" {
      - execution_arn                = "arn:aws:execute-api:ap-southeast-1:739349177655:c0ojzhtqbh" -> null
      - id                           = "c0ojzhtqbh" -> null
        name                         = "hello-world-terraform-aws"
      - root_resource_id             = "scg1ecaco9" -> null
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.prod_stage has been deleted
  - resource "aws_api_gateway_stage" "prod_stage" {
        id                    = "ags-c0ojzhtqbh-prod"
      - invoke_url            = "https://c0ojzhtqbh.execute-api.ap-southeast-1.amazonaws.com/prod" -> null
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.hello-world-terraform-aws has been deleted
  - resource "aws_iam_role" "hello-world-terraform-aws" {
      - arn                   = "arn:aws:iam::739349177655:role/hello-world-terraform-aws" -> null
        id                    = "hello-world-terraform-aws"
        name                  = "hello-world-terraform-aws"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.bye_world has been deleted
  - resource "aws_lambda_function" "bye_world" {
      - function_name                  = "ByeWorld" -> null
        id                             = "ByeWorld"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:739349177655:function:ByeWorld/invocations" -> null
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.hello_world has been deleted
  - resource "aws_lambda_function" "hello_world" {
      - function_name                  = "HelloWorld" -> null
        id                             = "HelloWorld"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:739349177655:function:HelloWorld/invocations" -> null
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.hello-world-terraform-aws will be created
  + resource "aws_api_gateway_deployment" "hello-world-terraform-aws" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
    }

  # aws_api_gateway_integration.bye_world_get will be created
  + resource "aws_api_gateway_integration" "bye_world_get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.hello_world_get will be created
  + resource "aws_api_gateway_integration" "hello_world_get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.bye_world_get will be created
  + resource "aws_api_gateway_method" "bye_world_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method.hello_world_get will be created
  + resource "aws_api_gateway_method" "hello_world_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.bye_world_api will be created
  + resource "aws_api_gateway_resource" "bye_world_api" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "bye"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.hello_world_api will be created
  + resource "aws_api_gateway_resource" "hello_world_api" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "hello"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.hello-world-terraform-aws will be created
  + resource "aws_api_gateway_rest_api" "hello-world-terraform-aws" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "hello-world-terraform-aws"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.prod_stage will be created
  + resource "aws_api_gateway_stage" "prod_stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_iam_role.hello-world-terraform-aws will be created
  + resource "aws_iam_role" "hello-world-terraform-aws" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hello-world-terraform-aws"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_lambda_function.bye_world will be created
  + resource "aws_lambda_function" "bye_world" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./hello-world-terraform-aws.zip"
      + function_name                  = "ByeWorld"
      + handler                        = "bye.lambdaHandler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.hello_world will be created
  + resource "aws_lambda_function" "hello_world" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./hello-world-terraform-aws.zip"
      + function_name                  = "HelloWorld"
      + handler                        = "app.lambdaHandler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.bye_world_permission will be created
  + resource "aws_lambda_permission" "bye_world_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ByeWorld"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # aws_lambda_permission.hello_world_permission will be created
  + resource "aws_lambda_permission" "hello_world_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "HelloWorld"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ base_url = "https://c0ojzhtqbh.execute-api.ap-southeast-1.amazonaws.com/prod" -> (known after apply)

```

</details>

*Pushed by: @kokchuan101, Action: `pull_request`*